<?xml version="1.0" ?>
<net name="torch-jit-export" version="11">
	<layers>
		<layer id="0" name="x.1" type="Parameter" version="opset1">
			<data shape="1,3,512,1024" element_type="f32"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="x.1"/>
				<attribute name="old_api_map_element_type" version="0" value="f16"/>
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="x.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_9093_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="0" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_9093" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="Constant_9093"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Subtract_9094" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Subtract_9094"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_149046_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 3, 1, 1" offset="6" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_149046" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Divide_9096" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_9095, Divide_9096"/>
				<attribute name="preprocessing" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="trunk.early.0.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 3, 3, 3" offset="12" size="864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="trunk.early.0.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="trunk.early.0.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="trunk.early.0.weight">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="343" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="340, 343"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="340,343">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="344" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="876" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="344"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="344"/>
			</output>
		</layer>
		<layer id="11" name="Constant_157" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_157"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="12" name="345" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="344, 345, Constant_157"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="345"/>
			</output>
		</layer>
		<layer id="13" name="355" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="892" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="355"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="355"/>
			</output>
		</layer>
		<layer id="14" name="356" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="355, 356, 357, 358"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="356,358"/>
			</output>
		</layer>
		<layer id="15" name="Constant_149049" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="900" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="16" name="362" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="359, 360, 361, 362"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="362"/>
			</output>
		</layer>
		<layer id="17" name="337" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1206, 1209, 334, 337"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="1206,1209,334,337">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="338" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="876" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="338"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="338"/>
			</output>
		</layer>
		<layer id="19" name="Constant_149" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_149"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="20" name="339" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="338, 339, Constant_149"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="339"/>
			</output>
		</layer>
		<layer id="21" name="363" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="363"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="363"/>
			</output>
		</layer>
		<layer id="22" name="364" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="908" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="364"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="364"/>
			</output>
		</layer>
		<layer id="23" name="365" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="364, 365, 366, 367"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="365,366,367"/>
			</output>
		</layer>
		<layer id="24" name="Constant_204" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_204"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="387" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="387, Constant_204"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="387">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="368" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="908" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="368"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="368"/>
			</output>
		</layer>
		<layer id="27" name="369" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="368, 369, 370, 371"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="369,370,371"/>
			</output>
		</layer>
		<layer id="28" name="372" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="372"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="372"/>
			</output>
		</layer>
		<layer id="29" name="Constant_206" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_206"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="388" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="388, Constant_206"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="388">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="341" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="908" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="341"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="341"/>
			</output>
		</layer>
		<layer id="32" name="Constant_153" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_153"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="33" name="342" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="341, 342, Constant_153"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="342"/>
			</output>
		</layer>
		<layer id="34" name="346" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="892" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="346"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="346"/>
			</output>
		</layer>
		<layer id="35" name="347" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="346, 347, 348, 349"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="347,349"/>
			</output>
		</layer>
		<layer id="36" name="Constant_149052" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="916" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="37" name="353" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="350, 351, 352, 353"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="353"/>
			</output>
		</layer>
		<layer id="38" name="335" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="908" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="335"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="335"/>
			</output>
		</layer>
		<layer id="39" name="Constant_145" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_145"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="40" name="336" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="335, 336, Constant_145"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="336"/>
			</output>
		</layer>
		<layer id="41" name="354" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="354"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="354"/>
			</output>
		</layer>
		<layer id="42" name="373" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="908" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="373"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="373"/>
			</output>
		</layer>
		<layer id="43" name="374" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="373, 374, 375, 376"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="374,375,376"/>
			</output>
		</layer>
		<layer id="44" name="Constant_208" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_208"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="389" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="389, Constant_208"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="389">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="377" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="908" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="377"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="377"/>
			</output>
		</layer>
		<layer id="47" name="378" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="377, 378, 379, 380"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="378,379,380"/>
			</output>
		</layer>
		<layer id="48" name="381" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="381"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="381"/>
			</output>
		</layer>
		<layer id="49" name="Constant_210" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_210"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="390" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="390, Constant_210"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="390">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="391" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="391, 399"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="391,399">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="400" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="924" size="32"/>
			<output>
				<port id="0" precision="I64" names="400">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="401" type="Concat" version="opset1">
			<data axis="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="393, 394, 397, 398, 400, 401"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="401">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="402" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="956" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="402"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="402">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="403" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="402, 403"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="403">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="405" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="972" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="404, 405, 406, 407, 408"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="405">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="406" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="980" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="404, 405, 406, 407, 408"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="406">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="407" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="972" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="404, 405, 406, 407, 408"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="407">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="408" type="StridedSlice" version="opset1">
			<data begin_mask="0" end_mask="0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask=""/>
			<rt_info>
				<attribute name="fused_names" version="0" value="404, 405, 406, 407, 408"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64" names="408">
					<dim>4</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_264" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="988" size="16"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_264"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="409" type="Transpose" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="409, Constant_264"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="409">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="410" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="972" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="410"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="410">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="411" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="410, 411, 412"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="411,412">
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_275" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_275"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="65" name="Split_276" type="Split" version="opset1">
			<data num_splits="2"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_275, Split_276"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>8</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="413_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="" offset="1004" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="67" name="413" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="413"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16"/>
			</input>
			<output>
				<port id="1" precision="FP32" names="413"/>
			</output>
		</layer>
		<layer id="68" name="414" type="Pad" version="opset1">
			<data pad_mode="constant"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="414"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>512</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32"/>
			</input>
			<output>
				<port id="4" precision="FP32" names="414">
					<dim>1</dim>
					<dim>3</dim>
					<dim>513</dim>
					<dim>1025</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="1226_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 3, 3, 3" offset="1006" size="864"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="1226" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="1226"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1226">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Convolution_856" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_856"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>513</dim>
					<dim>1025</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Reshape_876_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="1870" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Reshape_876" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="1225" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1225, Concat_875, Reshape_876"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1225">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="425" type="HSwish" version="opset4">
			<rt_info>
				<attribute name="fused_names" version="0" value="418, 421, 423, 424, 425, Maximum_908"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="425">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Reshape_921_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 3, 3" offset="1902" size="288"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Reshape_921" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="GroupConvolution_987" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="GroupConvolution_987, Reshape_921"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Reshape_1007_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="2190" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_1007" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="1228" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1228, Concat_1006, Reshape_1007"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1228">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="428" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="428"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="428">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="1232_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 1, 1" offset="2222" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="1232" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="1232"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1232">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Convolution_1036" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1036"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Reshape_1056_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="2734" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_1056" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="1231" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1231, Concat_1055, Reshape_1056"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1231">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="431" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="431"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="431">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="1235_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 16, 1, 1" offset="2766" size="2048"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="1235" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="1235"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1235">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Convolution_1085" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Convolution_1085"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Reshape_1105_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="4814" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_1105" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="1234" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="1234, Concat_1104, Reshape_1105"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1234">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="434" type="ReLU" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="434"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="434">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="trunk.block1.0.conv_dw.weight_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 1, 3, 3" offset="4942" size="1152"/>
			<output>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="trunk.block1.0.conv_dw.weight" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<rt_info>
				<attribute name="decompression" version="0"/>
				<attribute name="fused_names" version="0" value="trunk.block1.0.conv_dw.weight"/>
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="trunk.block1.0.conv_dw.weight">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="444" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="441, 444"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>64</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="441,444">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="445" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="876" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="445"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="445"/>
			</output>
		</layer>
		<layer id="101" name="Constant_1148" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1148"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="102" name="446" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="445, 446, Constant_1148"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="446"/>
			</output>
		</layer>
		<layer id="103" name="456" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="892" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="456"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="456"/>
			</output>
		</layer>
		<layer id="104" name="457" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="456, 457, 458, 459"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="457,459"/>
			</output>
		</layer>
		<layer id="105" name="Constant_149055" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="916" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="106" name="463" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="460, 461, 462, 463"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="463"/>
			</output>
		</layer>
		<layer id="107" name="438" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="435, 438"/>
			</rt_info>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64" names="435,438">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="439" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="876" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="439"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="439"/>
			</output>
		</layer>
		<layer id="109" name="Constant_1140" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1140"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="110" name="440" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="439, 440, Constant_1140"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64" names="440"/>
			</output>
		</layer>
		<layer id="111" name="464" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="464"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="464"/>
			</output>
		</layer>
		<layer id="112" name="465" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="908" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="465"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="465"/>
			</output>
		</layer>
		<layer id="113" name="466" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="465, 466, 467, 468"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="466,467,468"/>
			</output>
		</layer>
		<layer id="114" name="Constant_1195" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1195"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="488" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="488, Constant_1195"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="488">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="469" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="908" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="469"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="469"/>
			</output>
		</layer>
		<layer id="117" name="470" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="469, 470, 471, 472"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="470,471,472"/>
			</output>
		</layer>
		<layer id="118" name="473" type="Subtract" version="opset1">
			<data auto_broadcast="numpy"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="473"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="I64" names="473"/>
			</output>
		</layer>
		<layer id="119" name="Constant_1197" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1197"/>
			</rt_info>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="489" type="Unsqueeze" version="opset1">
			<rt_info>
				<attribute name="fused_names" version="0" value="489, Constant_1197"/>
			</rt_info>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="489">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="442" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="908" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="442"/>
			</rt_info>
			<output>
				<port id="0" precision="I64" names="442"/>
			</output>
		</layer>
		<layer id="122" name="Constant_1144" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="884" size="8"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="Constant_1144"/>
			</rt_info>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="123" name="443" type="Gather" version="opset8">
			<data batch_dims="0"/>
			<rt_info>
				<attribute name="fused_names" version="0" value="442, 443, Constant_1144"/>
			</rt_info>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
